countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                 "Северная Македония": "Скопье", "Сербия": "Белград"}
print(countries_dict)
print(countries_dict['Австрия'])
for key in sorted (countries_dict):
    print(key, ' - ', countries_dict[key])

def n2():
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }

    s = input('Введите слово: ')
    sum = 0
    for i in s:
        sum += alph[i]
    print(sum)

def n22():
    alph = {
        "авеинорст": 1,
        "дклмпу": 2,
        "бгёья": 3,
        "йы": 4,
        "жзхцч": 5,
        "шэю": 8,
        "фщъ": 10
    }

    s = input('Введите слово: ')
    sum = 0
    for i in s:
        for x in alph:
            if i in x:
                sum += alph[x.lower()]
    print(sum)


def n3():
    a = {'фамилия1' : 'русский, китайский', 'фамилия2' : 'английский, корейский', 'фомилия3' : 'немецкий, китайский'}
    lang = []
    st = []
    for i in a:
        c = a[i.lower()].split(', ')
        for x in c:
            lang.append(x)
            if x == 'китайский':
                st.append(i)
    lan = sorted(set(lang))
    print(lan)
    print(st)


n2(), n22(), n3()